examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider3_C.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39870072[ label="{Model|}"]

40107480[ label="{ID|}"]

39989976[ label="{STRING|}"]

40431048[ label="{BOOL|}"]

40360088[ label="{INT|}"]

39872072[ label="{FLOAT|}"]

40353000[ label="{STRICTFLOAT|}"]

40291048[ label="{NUMBER|}"]

40295528[ label="{BASETYPE|}"]

39803384[ label="{*OBJECT|}"]

40037496[ label="{Cls|+name:ID\l}"]

40614696[ label="{Method|+name:ID\l}"]

39828104[ label="{Obj|+name:ID\l}"]

40573480[ label="{Call|+name:ID\l}"]

40579016[ label="{Import|+importURI:STRING\l}"]

40486680[ label="{Comment|\\/\\/.*}"]



39870072 -> 40579016[arrowtail=diamond, dir=both, headlabel="imports 1..*"]
39870072 -> 40037496[arrowtail=diamond, dir=both, headlabel="cls 1..*"]
39870072 -> 39828104[arrowtail=diamond, dir=both, headlabel="obj 1..*"]
39870072 -> 40573480[arrowtail=diamond, dir=both, headlabel="call 1..*"]
40291048 -> 40353000 [dir=back]
40291048 -> 40360088 [dir=back]
40295528 -> 40291048 [dir=back]
40295528 -> 39872072 [dir=back]
40295528 -> 40431048 [dir=back]
40295528 -> 40107480 [dir=back]
40295528 -> 39989976 [dir=back]
39803384 -> 40295528 [dir=back]
40037496 -> 40037496[headlabel="extends 1..*"]
40037496 -> 40614696[arrowtail=diamond, dir=both, headlabel="methods 1..*"]
39828104 -> 40037496[headlabel="ref "]
40573480 -> 39828104[headlabel="obj "]
40573480 -> 40614696[headlabel="method "]

}
